# SetHookOrientationAngle Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarUpdateCurvesData..::..SetHookOrientationAngle Method
RebarUpdateCurvesData Class See Also
---
Set the hook orientation angle at end. This information is set to the rebar after the API execution is finished successfully.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public void SetHookOrientationAngle(
	int end,
	double angle
)
```

Visual Basic
---
```text
Public Sub SetHookOrientationAngle ( _
	end As Integer, _
	angle As Double _
)
```

Visual C++
---
```text
public:
void SetHookOrientationAngle(
	int end,
	double angle
)
```

# ### Parameters
end
    Type: System..::..Int32 The end of bar. Should be 0 for start or 1 for end.
angle
    Type: System..::..Double The hook orientation angle at end.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | Invalid end. |

# See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace